app/views/subjects/list.html.erb

			<td><%= subject.visible ? 'Yes' : 'No' %></td>
			<td><%= subject.pages.size %></td>
---
SELECT COUNT(*) FROM `pages` WHERE `pages`.`subject_id` = 1