app/controllers/subjects_controller.rb

SELECT `subjects`.* FROM `subjects` ORDER BY subjects.position ASC
---
  def list
    @subjects = Subject.order('subjects.position ASC')

INSERT INTO `subjects` (`created_at`, `name`, `position`, `updated_at`, `visible`) VALUES ('2013-03-08 15:07:43', 'Test Subject', 8, '2013-03-08 15:07:43', 0)
---
  def create
    # instantiate a new object using form parameters
    @subject = Subject.new(params[:subject])
    # save object
    if @subject.save

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 5 LIMIT 1
UPDATE `subjects` SET `position` = 7, `updated_at` = '2013-03-08 15:25:39' WHERE `subjects`.`id` = 5
---
  def update
    # find object using form parameters
    @subject = Subject.find(params[:id])
    # update the object
    if @subject.update_attributes(params[:subject])

DELETE FROM `subjects` WHERE `subjects`.`id` = 5
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 5 LIMIT 1
---
  def destroy
    # destroy object
    Subject.find(params[:id]).destroy